Revit 2026 API

# MEPBuildingConstructionSetBuildingConstruction Method

---

Sets the Building Construction of the Project Information.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetBuildingConstruction(
	ConstructionType constructionType,
	Construction buildingConstruction
)
```
```vb
Public Sub SetBuildingConstruction (
	constructionType As ConstructionType,
	buildingConstruction As Construction
)
```
```cpp
public:
void SetBuildingConstruction(
	ConstructionType constructionType,
	Construction^ buildingConstruction
)
```
```fsharp
member SetBuildingConstruction :
        constructionType : ConstructionType *
        buildingConstruction : Construction -> unit
```

#### Parameters

constructionType ConstructionType
    The Construction Type of Building Construction.
buildingConstruction Construction
    The Building Construction to be set.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | buildingConstruction is NULL. |
| InvalidOperationException | Sets construction type to an invalid value. \- or - Can not set construction type. |

This function is used to set the Building Construction of the Project Information.

#### Reference

MEPBuildingConstruction Class

Autodesk.Revit.DB.Mechanical Namespace